# Задача №49. Решение в группах
# Планеты вращаются вокруг звезд по эллиптическим орбитам.
# Назовем самой далекой планетой ту, орбита которой имеет
# самую большую площадь. Напишите функцию
# find_farthest_orbit(list_of_orbits), которая среди списка орбит
# планет найдет ту, по которой вращается самая далекая
# планета. Круговые орбиты не учитывайте: вы знаете, что у
# вашей звезды таких планет нет, зато искусственные спутники
# были были запущены на круговые орбиты. Результатом
# функции должен быть кортеж, содержащий длины полуосей
# эллипса орбиты самой далекой планеты. Каждая орбита
# представляет из себя кортеж из пары чисел - полуосей ее
# эллипса. Площадь эллипса вычисляется по формуле S = pi*a*b,
# где a и b - длины полуосей эллипса. При решении задачи
# используйте списочные выражения. Подсказка: проще всего
# будет найти эллипс в два шага: сначала вычислить самую
# большую площадь эллипса, а затем найти и сам эллипс,
# имеющий такую площадь. Гарантируется, что самая далекая
# планета ровно одна
# Пример ввода и вывода данных представлены на
# следующем слайде

# Задача №49. Решение в группах
# Ввод:
# orbits = [(1, 3), (2.5, 10), (7, 2), (6, 6), (4, 3)]
# print(*find_farthest_orbit(orbits))
# Вывод:
# 2.5 10

orbits = [(1, 3), (2.5, 10), (7, 2), (6, 6), (4, 3)]
def find_farthest_orbit(orb):
    orb = list(filter(lambda x: x[0] - x[1], orb))
    for i in orb:
        if i[0] * i[1] == max(list(map(lambda x: x[0] * x[1], orb))):
            return i  

print(find_farthest_orbit(orbits))
print(max(orbits, key = lambda x: x[0] * x[1] * (x[0] != x[1])))

numbers = "2 12 -4 77 -38 8"
print(list(filter(lambda x: (len(str(abs(x))) == 2), map(int, numbers.split(" ")))))
print(list(filter(lambda x: (len(str(abs(int(x)))) == 2), numbers.split(" "))))
print(list(filter(lambda x: 9 < abs(x) < 100, map(int, numbers.split()))))